import tkinter as tk
import random as r
root =tk.Tk()
root.geometry("1800x900")
root.title("прогноз погоди")
label = tk.Label(root, text="в якому місті в хочете подивитись погоду?",
font=("Arial", 30), fg="blue", bg="yellow")
label.pack()
def f():
    text = entry.get()
    pohoda = [f"в {text} зраз розсіювання хмар через сором.\nВони просто не витримали погляду сонця."], [f"в {text} спонтанний град з котлет.\nПарасолі не врятують — тільки тарілка і виделка."],[f"в {text} так сильно світить сонце, що всі квіти на клумбах самі гуглять:\n 'де купити крем від засмаги'."],[f"в {text} веселковий дощ із запахом кавуна.\nБудьте обережні — слизько і дуже смачно"],[f"в {text} Вітер до 40 смішків за годину.\nМоже здути кепку і настрій!"],[f"в {text} випадання локшини на вуха.\nОсобливо у тих, хто слухає прогноз погоди на телебаченні!"],[f"в {text} спостерігається мокрий сарказм\n із переходом у легку іронію!"],[f"в {text} циклон на ім’я Степан.\nХодить по подвір’ях, заплутує білизну на мотузках і стукає у вікна з фразою:\n 'А можна сіль?!'."],[f"в {text} дощ із рівномірним випаданням шкарпеток на тротуари.\nМісцями можливі тапки."],[f"в {text} спека така, що в тіні +30, а на сонці — вже шашлик.\nНе забудьте перевертатися, щоб рівномірно засмагти."],[f"в {text} місцями тумани із запахом пельменів.\nЦе просто хтсь відкриває вікна."],[f"в {text} гроза буде, але лінива.\nГримітиме, поки не набридне, потім піде їсти борщ."],[f"в {text} на півночі можливий несподіваний сніг у липні.\nБо хтось знову перезапустив 2020 рік."]
    label.config(text=r.choice(pohoda))

entry = tk.Entry()
entry.pack()

button = tk.Button(root, text="Push me", command=f)
button.pack()



root.mainloop()