import tkinter as tk
import random as r
root =tk.Tk()
root.geometry("1800x900")
root.title("My super program")
label = tk.Label(root, text="в якому місті в хочете подивитись погоду?",
font=("Arial", 30), fg="blue", bg="yellow")
label.pack()
def f():
    text = entry.get()
    pohoda = [f"в {text} зраз розсіювання хмар через сором.Вони просто не витримали погляду сонця."
              f"в {text} спонтанний град з котлет.Парасолі не врятують — тільки тарілка і виделка."
              f"в {text} так сильно світить сонце, що всі квіти на клумбах самі гуглять: 'де купити крем від засмаги'."
              f"в {text} веселковий дощ із запахом кавуна.Будьте обережні — слизько і дуже смачно"
              f"в {text} Вітер до 40 смішків за годину.Може здути кепку і настрій!"
              f"в {text} випадання локшини на вуха.Особливо у тих, хто слухає прогноз погоди на телебаченні!"
              f"в {text} у регіоні спостерігається мокрий сарказм із переходом у легку іронію!"
              f"в {text} циклон на ім’я Степан.Ходить по подвір’ях, заплутує білизну на мотузках і стукає у вікна з фразою 'А можна сіль'."
              f"в {text} дощ із рівномірним випаданням шкарпеток на тротуари.Місцями можливі тапки."
              f"в {text} спека така, що в тіні +30, а на сонці — вже шашлик.Не забудьте перевертатися, щоб рівномірно засмагти."
              f"в {text} місцями тумани із запахом пельменів.Це просто хтсь відкриває вікна."
              f"в {text} гроза буде, але лінива.Гримітиме, поки не набридне, потім піде їсти борщ."
              f"в {text} на півночі можливий несподіваний сніг у липні.Бо хтось знову перезапустив 2020 рік."]
    label.config(text=r.choice(pohoda))

entry = tk.Entry()
entry.pack()

button = tk.Button(root, text="Push me", command=f)
button.pack()



root.mainloop()