# Іменник
# Колір
# Дієслово
# Назва тварини
# Назва місця
#
#
#  І видаємо текст, де замість квадратних дужок — слова, введені користувачем:
#
# Одного разу [Іменник] був дуже сумний, тому що він був [Колір]. Він вирішив
# [Дієслово] у [Назва місця], де зустрів [Назва тварини]. Разом вони вирішили
# залишитися в [Назва місця] назавжди, і стали найкращими друзями.




noun = input("Ведіть іменник")
color = input("Ведіть колір")
verb = input("Ведіть дієслово")
animal = input("Ведіть назву тварини")
city = input("Ведіть місце")
print("Одного разу", noun, "був дуже сумний, тому що він був", color,
      "Він вирішив", verb, "у", city, "- де зустрів",
      animal, "Разом вони вирішили залишитися в", city,
      "назавжди, і стали найкращими друзями.")